"use client";

import React from "react";
import s from "./PrivacyPolicySection.module.css";

export default function PrivacyPolicySection() {
  return (
    <div className={s.contract}>
      <div className={s.container}>
        <h1 className={s.title}>Політика конфіденційності</h1>

        <div className={s.content}>
          <div className={s.section}>
            <div className={s.sectionContent}>
              <p className={s.text}>Дата набрання чинності: 20 грудня, 2025</p>
              <p className={s.text}>
                Політика конфіденційності та захисту персональних даних (надалі
                – "Політика") розроблена для вебсайту https://www.bfb.in.ua/
                (надалі – "Вебсайт"/ "Сайт") з метою пояснити його користувачам,
                в яких цілях та які саме персональні дані особи збираються,
                обробляються, використовуються та зберігаються при користуванні
                даним вебсайтом та при приєднанні до умов Договору публічної
                оферти.
              </p>
              <p className={s.text}>
                Просимо Вас уважно ознайомитись з Політикою у разі, якщо Ви
                хочете користуватися функціями Вебсайту, мати можливість
                акцептування договору публічної оферти, розміщеного на ньому,
                отримання технічної підтримки та/або отримання в подальшому
                персонального доступу до особистого кабінету.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>1. ВИЗНАЧЕННЯ ТЕРМІНІВ</h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                <strong className={s.boldText}>1.1. Вебсайт (Сайт)</strong>
              </p>
              <p className={s.text}>
                Це сукупність програмних, інформаційних, а також будь-яких інших
                засобів, логічно пов'язаних між собою, доступних у мережі
                Інтернет за адресою: https://www.bfb.in.ua/.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>
                  1.2. Володілець персональних даних
                </strong>
              </p>
              <p className={s.text}>
                Фізична особа, яка визначає мету обробки персональних даних,
                встановлює склад цих даних та процедури їх обробки, якщо інше не
                визначено законом.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.3. Користувач</strong>
              </p>
              <p className={s.text}>
                Будь-яка фізична особа, яка має доступ до Сайту, яка
                використовує Сайт з допомогою мережі Інтернет.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.4. Персональні дані</strong>
              </p>
              <p className={s.text}>
                Відомості чи сукупність відомостей про фізичну особу, яка
                ідентифікована або може бути конкретно ідентифікована.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>
                  1.5. Договір публічної оферти
                </strong>
              </p>
              <p className={s.text}>
                Пропозиція Адміністрації вебсайту, адресована будь-якій особі
                укласти з ним публічний договір про надання послуг, що розміщена
                на Сайті чи на одній з вебсторінок Сайту.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>
                  1.6. Розпорядник персональних даних
                </strong>
              </p>
              <p className={s.text}>
                Фізична чи юридична особа, якій володільцем персональних даних
                або законом надано право обробляти ці дані від імені володільця.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.7. Фінансовий агент</strong>
              </p>
              <p className={s.text}>
                Платіжна система (в особі Товариства з обмеженою
                відповідальністю "ФІНАНСОВА КОМПАНІЯ "ВЕЙ ФОР ПЕЙ"), яка
                реалізовує організацію та здійснення переказу грошових коштів за
                дорученням Адміністрації вебсайту із використанням електронних
                способів обробки платежів за реалізовані товари або послуги на
                Сайті.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>
                  1.8. Суб'єкт персональних даних
                </strong>
              </p>
              <p className={s.text}>
                Фізична особа, персональні дані якої обробляються.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.9. Розсилка</strong>
              </p>
              <p className={s.text}>
                Електронні, текстові та/або мультимедійні повідомлення на
                електронну пошту (e-mail), номер контактного телефону, облікові
                записи Користувача в додатках Telegram, Viber тощо із
                комерційною та/або некомерційною пропозицією від Адміністрації
                вебсайту та/або третіх осіб.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.10. Товар</strong>
              </p>
              <p className={s.text}>
                Спортивна продукція та їх послуги, а також будь-яка інша
                продукція з наведеного на вебсайті асортименту, що пропонується
                до придбання Користувачам на умовах Договору публічної оферти.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.11. Особистий кабінет</strong>
              </p>
              <p className={s.text}>
                Персоналізований обліковий запис Користувача на Вебсайті, доступ
                до якого надається після авторизації або реєстрації.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.12. Уповноважені особи</strong>
              </p>
              <p className={s.text}>
                Підрядники Адміністрації сайту, яким наданий доступ до
                персональних даних, зокрема Служба підтримки за Договором
                публічної оферти.
              </p>

              <p className={s.text}>
                <strong className={s.boldText}>1.13. Cookies-файли</strong>
              </p>
              <p className={s.text}>
                Невеликий фрагмент даних (текстовий файл), який вебсайт під час
                його відвідування Користувачем зберігає на
                електронно-обчислювальному пристрої (комп'ютера, телефону,
                планшета і т.д.) Користувача.
              </p>

              <p className={s.text}>
                Зазначені терміни мають тотожне значення при вживанні в однині і
                в множині, а також при написанні з великої і малої літери. Інші
                терміни, які використовуються в Політиці, визначаються
                відповідно до норм законодавства України, а в разі відсутності
                визначення в законодавстві – мають загальновживане значення або
                визначаються за правилами ділового обороту.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                2.1. Політика розроблена з урахуванням всіх вимог та відповідно
                до:
              </p>
              <ul className={s.list}>
                <li>
                  Регламенту ЄС від 27.04.2016 № 2016/679 (GDPR – General Data
                  Protection Regulation);
                </li>
                <li>Закону України "Про захист персональних даних";</li>
                <li>
                  Інших нормативних актів законодавства України, що
                  регламентують правові відносини, пов'язані зі збором,
                  обробкою, зберіганням персональних даних, а також правом
                  громадян на невтручання в особисте життя та правом на
                  самовираження.
                </li>
              </ul>

              <p className={s.text}>
                2.2. Положення Політики застосовуються виключно до Сайту, що
                розташований за адресою: (вставити актуальний домен).
              </p>

              <p className={s.text}>
                2.3. Адміністрація Сайту не контролює і не несе відповідальність
                за операції з персональними даними через:
              </p>
              <ul className={s.list}>
                <li>
                  Сервіси, що забезпечують повноцінне функціонування Сайту та
                  процес оплати за курси, що на ньому доступні, зокрема сервіси
                  Фінансового агента;
                </li>
                <li>
                  месенджери та інші засоби зв'язку, що забезпечують комунікацію
                  між Адміністрацією та користувачами Сайту.
                </li>
              </ul>

              <p className={s.text}>
                2.4. Адміністрація Сайту залишає за собою право вносити будь-які
                зміни та виправлення до Політики у разі зміни способу, порядку
                та/або мети збирання, обробки, використання або зберігання
                персональних даних, отримуваних Адміністрацією.
              </p>

              <p className={s.text}>
                2.5. Політика вважається дійсною в тій редакції та на тих
                умовах, які існували на момент її прийняття Користувачем з
                унесеними до Політики змінами на умовах, визначених Політикою
                (якщо такі зміни вносилися протягом періоду обробки персональних
                даних Користувача).
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              3. КАТЕГОРІЯ СУБ'ЄКТІВ ПЕРСОНАЛЬНИХ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                3.1. До категорії суб'єктів персональних даних можуть входити
                Користувачі Сайту, які надали згоду з умовами Політики
                конфіденційності та особи, які уклали договір приєднання з
                Адміністрацією Сайту шляхом акцепту Публічної оферти.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              4. ПРЕДМЕТ ПОЛІТИКИ ТА СКЛАД ПЕРСОНАЛЬНИХ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                4.1. Політикою на Адміністрацію Сайту та на Уповноважених осіб
                покладається зобов'язання щодо нерозголошення та забезпечення
                режиму захисту конфіденційності персональних даних Користувачів.
              </p>

              <p className={s.text}>
                4.2. Політика встановлює мету (цілі) та підстави обробки
                персональних даних, категорії суб'єктів персональних даних,
                склад персональних даних, порядок обробки персональних даних та
                Cookies-файлів, а також порядок здійснення розсилки, згоду із
                якими надав Користувач Сайту.
              </p>

              <p className={s.text}>
                4.3. Джерела, з яких отримуються персональні дані, що
                використовуються згідно з даною Політикою:
              </p>
              <ul className={s.list}>
                <li>
                  4.3.1. Реєстраційні форми: шляхом заповнення Користувачем форм
                  при обранні конкретного Товару.
                </li>
                <li>
                  4.3.2. Електронна пошта: шляхом отримання/надсилання
                  електронних повідомлень при взаємодії з Адміністрацією чи
                  Уповноваженими особами.
                </li>
                <li>
                  4.3.3. Телефон: шляхом здійснення дзвінків для комунікації з
                  Адміністрацією сайту чи Уповноваженими особами.
                </li>
                <li>
                  4.3.4. Взаємодія з рекламою: взаємодія з рекламними
                  оголошеннями про послуги Адміністрації Сайту на сторонніх
                  сайтах.
                </li>
                <li>
                  4.3.5. Дані з інших джерел: соціальні мережі (наприклад,
                  Telegram, Instagram, Facebook), маркетингові дослідження,
                  публічні та інші джерела, з яких Адміністрація сайту або
                  Уповноважені особи отримали доступ до персональних даних.
                </li>
              </ul>

              <p className={s.text}>
                4.4. Адміністрація збирає лише ті персональні дані, які були
                свідомо і добровільно надані самим Користувачем для користування
                Сайтом, замовлення послуг та/або для комунікації з
                Адміністрацією чи Уповноваженими особами.
              </p>

              <p className={s.text}>
                4.5. При використанні Користувачем будь-яких джерел, визначених
                Політикою, здійснюється обробка його персональних даних, до яких
                в тих чи інших випадках можуть відноситись:
              </p>
              <ul className={s.list}>
                <li>прізвище;</li>
                <li>ім'я;</li>
                <li>по-батькові;</li>
                <li>контактний номер телефону;</li>
                <li>адреса електронної пошти;</li>
                <li>місце доставки товарів або точна адреса;</li>
                <li>платіжні реквізити;</li>
                <li>дата, місяць та рік народження;</li>
                <li>дані про стан здоров'я.</li>
              </ul>

              <p className={s.text}>
                4.6. Адміністрація Сайту залишає за собою право автоматичного
                збору Cookies-файлів в процесі відвідування Користувачем Сайту.
              </p>

              <p className={s.text}>
                4.7. Адміністрація Сайту не збирає дані, щодо збору яких
                встановлені обмеження та/або заборона відповідно до Закону
                України "Про захист персональних даних", а також не здійснює
                обробку персональних даних, яка становить особливий ризик для
                прав і свобод суб'єктів персональних даних.
              </p>

              <p className={s.text}>
                4.8. Для здійснення оплати послуг за Публічною офертою,
                Користувач переходить за посиланням на захищену сторінку
                Фінансового агенту. У передбаченому місці Користувач повинен
                вказати реквізити своєї платіжної карти. Всі платежі
                обробляються Фінансовим агентом відповідно до стандартів захисту
                реквізитів картки.
              </p>

              <p className={s.text}>
                4.9. Обробку персональних даних щодо банківських рахунків,
                банківських карток, платіжної інформації тощо здійснює
                Фінансовий агент відповідно до Політики конфіденційності або
                інших документів Фінансового агенту.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              5. СКЛАД ТА ПОРЯДОК ОБРОБКИ COOKIES-ФАЙЛІВ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                5.1. Адміністрація Сайту використовує сервіс для веб-аналітики
                Google Analytics, що пропонує Google Inc. (далі – "Google"), а
                також збирає власні сеансові Cookies-файли виключно для
                відслідковування статистики відвідування Сайту та можливості
                його оптимізації і адаптації інтересів кожного Користувача.
              </p>

              <p className={s.text}>
                5.2. Google Analytics використовують Cookies-файли, які
                зберігаються на електронно-обчислювальному пристрої для
                полегшення аналізу використання вебсайту та зберігають
                інформацію про онлайн-поведінку Користувача. Cookies-файли не
                завдають шкоди електронно-обчислювальному пристрою Користувача
                та не містять вірусів.
              </p>

              <p className={s.text}>
                5.3. Cookies-файли Google можуть збирати наступну інформацію:
              </p>
              <ul className={s.list}>
                <li>
                  5.3.1. адреси вебсторінок вебсайту, які переглядав Користувач;
                </li>
                <li>
                  5.3.2. адреси попередніх вебсторінок, з яких було отримано
                  доступ до вебсайту;
                </li>
                <li>5.3.3. мовні налаштування браузера;</li>
                <li>5.3.4. час, дата та тривалість відвідування вебсайту;</li>
                <li>
                  5.3.5. інформації про браузер Користувача, в т.ч.
                  найменування, версію браузера і т.д.
                </li>
              </ul>

              <p className={s.text}>
                5.4. Цією Політикою конфіденційності передбачено можливість
                обробляти "сеансові" та "постійні" Cookies-файли.
              </p>

              <p className={s.text}>
                5.5. "Сеансові" Cookies-файли є тимчасовими і зберігаються
                тільки до моменту закінчення сеансу браузера.
              </p>

              <p className={s.text}>
                5.6. "Постійні" Cookies-файли залишаються на жорсткому диску
                електронно-обчислювального пристрою Користувача або на
                електронному носії до тих пір, поки Користувач не видалить їх.
              </p>

              <p className={s.text}>
                5.7. Інформація про використання Користувачем Сайту, створена
                Cookies-файлами Google, передається і зберігається на сервері
                Google у Сполучених Штатах Америки. Google використовуватиме цю
                інформацію для оцінки використання Користувачем Сайту, для
                складання звітів про діяльність Сайту та для надання
                Адміністрації сайту інших послуг, пов'язаних із діяльністю Сайту
                та використанням Інтернету. IP-адреса, передана з браузера
                Користувача, як частина Google Analytics, не буде об'єднана з
                будь-якими іншими даними, якими володіє Google.
              </p>

              <p className={s.text}>
                5.8. Адміністрація вебсайту може обробляти:
              </p>
              <ul className={s.list}>
                <li>
                  5.8.1. Необхідні Cookies-файли допомагають зробити вебсайт
                  придатним для використання, забезпечуючи основні функції, такі
                  як навігація сторінкою та доступ до захищених областей
                  вебсайту. Вебсайт не може працювати належним чином без цих
                  файлів Cookies-файлів.
                </li>
                <li>
                  5.8.2. Статистичні файли Cookies-файли допомагають
                  Адміністрації вебсайту зрозуміти, як відвідувачі взаємодіють
                  із вебсайтом, збираючи та анонімно повідомляючи інформацію.
                </li>
                <li>
                  5.8.3. Маркетингові Cookies-файли використовуються для
                  відстеження Користувачів вебсайтів. Мета полягає в тому, щоб
                  показувати оголошення, які є релевантними та привабливими для
                  окремого Користувача, а отже, більш цінними для видавців.
                </li>
              </ul>

              <p className={s.text}>
                5.9. Користувач має право відмовитися від використання
                Cookies-файлів шляхом зміни відповідних налаштувань в
                програмному забезпеченні свого браузера або шляхом відправлення
                електронного листа на електронну пошту, зазначену на вебсайті
                Адміністрації. У випадку відмови від обробки Cookies-файлів,
                Користувач не зможе використовувати всі функції вебсайту.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              6. МЕТА (ЦІЛЬ) ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                6.1. Обробка персональних даних за цією Політикою
                конфіденційності здійснюється з метою (ціллю) належного надання
                Адміністрацією вебсайту послуг Користувачу, а саме:
              </p>
              <ul className={s.list}>
                <li>
                  6.1.1. надання доступу до Вебсайту та, зокрема до Особистого
                  кабінету;
                </li>
                <li>
                  6.1.2. комунікація з Користувачем за допомогою платформ та
                  сервісів, що забезпечують використання текстового, аудіо- та
                  відеозв'язку, для постачання Товарів та надання послуг
                  Адміністрацією вебсайту;
                </li>
                <li>
                  6.1.3. здійснення розсилки за додатковою згодою суб'єкта
                  персональних даних на адресу електронної пошти;
                </li>
                <li>
                  6.1.4. надання Користувачеві ефективної клієнтської і
                  технічної підтримки при виникненні проблем, пов'язаних із
                  використанням Сайту;
                </li>
                <li>6.1.5. контролю навантаження на Сайт;</li>
                <li>
                  6.1.6. проведення аналізу щодо ефективності рекламних
                  кампаній, трафік яких налаштований на вебсайт;
                </li>
                <li>
                  6.1.7. проведення статистичних та інших досліджень на основі
                  знеособлених даних.
                </li>
              </ul>

              <p className={s.text}>
                6.2. Персональні дані Користувача можуть бути використані для
                інших цілей, не передбачених Політикою конфіденційності, що є
                необхідними для належного виконання покладених на Адміністрацію
                сайту та Уповноважених осіб Договором публічної оферти своїх
                зобов'язань.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              7. ПІДСТАВИ ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                7.1. Бути суб'єктом персональних даних та надавати згоду на
                обробку своїх персональних даних має право особа, яка набула
                повної цивільної дієздатності відповідно до чинного
                законодавства держави свого громадянства. У випадку, якщо в
                особи відсутній достатній рівень дієздатності, то згоду на
                обробку персональних даних такої особи надають батьки, опікуни
                (піклувальники), усиновлювачі.
              </p>

              <p className={s.text}>
                7.2. Згода на обробку персональних даних надається Користувачем
                шляхом:
              </p>
              <ul className={s.list}>
                <li>
                  7.2.1. проставлення відмітки про надання дозволу на обробку
                  персональних даних під час відвідування вебсайту;
                </li>
                <li>
                  7.2.2. здійснення комунікації з Адміністрацією та/або
                  Уповноваженими особами через засоби дистанційного зв'язку,
                  зокрема за допомогою електронної пошти або месенджера
                  "Telegram".
                </li>
              </ul>

              <p className={s.text}>
                7.3. Згода на обробку Cookies-файлів надається Користувачем
                шляхом проставлення відмітки про надання дозволу в спливаючому
                вікні.
              </p>

              <p className={s.text}>
                7.4. На вебсайті не передбачено можливості обробки персональних
                даних до моменту проставляння відмітки.
              </p>

              <p className={s.text}>
                7.5. Шляхом надання згоди на обробку даних у порядку,
                передбаченому цим Розділом, Користувач повністю і безумовно
                погоджується з усіма положеннями Політики. Користувач дає свою
                згоду Адміністрації вебсайту на збір, систематизацію,
                накопичення, зберігання, уточнення (оновлення, виправлення),
                використання, поширення, знеособлення, блокування, копіювання,
                поширення, а також від інших неправомірних дій третіх осіб.
              </p>

              <p className={s.text}>
                7.6. У разі, якщо Користувач не надає згоду на обробку його
                персональних даних у порядку, передбаченому п. 7.2 Політики,
                Користувач не матиме можливості придбавати Товари та/або
                послуги, передбачені Договором публічної оферти.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              8. ПОРЯДОК ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                8.1. Адміністрація вебсайту збирає персональні дані з джерел, що
                передбачені у Розділі 4 Політики.
              </p>

              <p className={s.text}>
                8.2. Накопичення зібраних персональних даних відбувається шляхом
                внесення їх до відповідної бази даних, що зберігається в
                електронній формі у мережі Інтернет за допомогою технічних
                можливостей Вебсайту.
              </p>

              <p className={s.text}>
                8.3. Персональні дані Користувача зберігаються протягом строку,
                що необхідний для виконання Адміністрацією вебсайту своїх
                зобов'язань за Договором публічної оферти або до моменту їх
                зміни чи видалення за вимогою Користувача.
              </p>

              <p className={s.text}>
                8.4. Персональні дані зберігаються у базі персональних даних в
                електронній формі під юрисдикцією України.
              </p>

              <p className={s.text}>
                8.5. Адміністрація вебсайту використовує персональні дані для
                належного постачання Товарів та надання послуг Користувачу.
              </p>

              <p className={s.text}>
                8.6. Як та для чого використовуються персональні дані:
              </p>
              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>8.6.1. Прізвище:</strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для комунікації з Адміністрацією сайту та Уповноваженими
                  особами.
                </li>
                <li>
                  Для ідентифікації Користувача як сторони Договору публічної
                  оферти.
                </li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>8.6.2. Ім'я:</strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для комунікації з Адміністрацією сайту та Уповноваженими
                  особами.
                </li>
                <li>
                  Для ідентифікації Користувача як сторони Договору публічної
                  оферти.
                </li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>8.6.3. По-батькові:</strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для комунікації з Адміністрацією сайту та Уповноваженими
                  особами.
                </li>
                <li>
                  Для ідентифікації Користувача як сторони Договору публічної
                  оферти.
                </li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>
                    8.6.4. Адреса електронної пошти:
                  </strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для надання Користувачу персоніфікованого доступу до
                  особистого кабінету на Навчальній платформі.
                </li>
                <li>
                  Для здійснення розсилки (за додатковою згодою Користувача).
                </li>
                <li>
                  Для комунікації з Адміністрацією сайту та Уповноваженими
                  особами.
                </li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>
                    8.6.5. Контактний номер телефону:
                  </strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для комунікації з Адміністрацією сайту та Уповноваженими
                  особами.
                </li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>
                    8.6.6. Місце доставки товарів або точна адреса:
                  </strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>Для здійснення доставки замовленого Товару.</li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>
                    8.6.7. Платіжні реквізити:
                  </strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для ідентифікації Користувача у питаннях оплати Товару та
                  розрахунків з ним.
                </li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>
                    8.6.8. Дата, місяць та рік народження:
                  </strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для ідентифікації Користувача як учасника Бонусної системи та
                  інших акційних програм.
                </li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>
                    8.6.9. Дані про стан здоров'я:
                  </strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>(немає зазначеного використання).</li>
              </ul>

              <ul className={s.list}>
                <li>
                  <strong className={s.boldText}>8.6.10. Cookies-файли:</strong>
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  Для забезпечення можливості суб'єкта персональних даних
                  безперешкодно користуватися інтерфейсом вебсайту.
                </li>
              </ul>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              9. ПОРЯДОК ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ ДЛЯ МАРКЕТИНГОВИХ ЦІЛЕЙ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                9.1. Адміністрація сайту може здійснювати розсилку електронних,
                текстових та/або мультимедійних повідомлень на адресу
                електронної пошти, номер контактного телефону, облікові записи
                Користувача в додатках Telegram, Instagram, Viber тощо із
                комерційною та/або некомерційною пропозицією від Адміністрації
                та/або третіх осіб.
              </p>

              <p className={s.text}>
                9.2. Мета Розсилки полягає в наданні доступу до Особистого
                кабінету, у інформуванні суб'єкта персональних даних про товари,
                послуги, заходи тощо Адміністрації сайту та/або його партнерів,
                а також у здійсненні анонімних опитувань з метою вивчення думки
                про товари, послуги, заходи тощо.
              </p>

              <p className={s.text}>
                9.3. Суб'єкт персональних даних дає додаткову згоду на
                здійснення Адміністрацією сайту Розсилки шляхом надання згоди на
                обробку персональних даних у порядку, визначеному Політикою.
              </p>

              <p className={s.text}>
                9.4. Суб'єкт персональних даних має право у будь-який момент
                відмовитися від Розсилки шляхом зміни налаштувань за посиланням,
                вказаним в електронному листі та/або шляхом надсилання на
                електронну пошту Адміністрації сайту заяви про відмову від
                Розсилки.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              10. ПОРЯДОК ДОСТУПУ ОСІБ, ЯКІ ОБРОБЛЯЮТЬ ПЕРСОНАЛЬНІ ДАНІ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                10.1. Адміністрація вебсайту обробляє персональні дані за
                допомогою автоматизованої обробки та/або особисто та/або із
                залученням третіх осіб, що надають послуги або виконують
                обов'язки від імені Адміністрації вебсайту, включаючи обробку
                бізнес-аналітики, обслуговування клієнтів, маркетинг, проведення
                опитувань.
              </p>

              <p className={s.text}>
                10.2. Адміністрація вебсайту веде за допомогою автоматизованої
                системи облік операцій, пов'язаних з обробкою персональних даних
                суб'єкта персональних даних та зберігає такі відомості протягом
                1 (одного) року з моменту здійснення операції.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              11. ПРАВА ТА ОБОВ'ЯЗКИ СУБ'ЄКТА ПЕРСОНАЛЬНИХ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                11.1. Суб'єкт персональних даних має право:
              </p>
              <ul className={s.list}>
                <li>
                  11.1.1. Отримати відомості щодо мети (цілей), для яких
                  обробляються його персональні дані.
                </li>
                <li>
                  11.1.2. Отримувати відомості щодо строку, протягом якого
                  обробляються персональні дані.
                </li>
                <li>
                  11.1.3. Отримувати відомості щодо алгоритму автоматизованої
                  обробки персональних даних та наслідків такої обробки.
                </li>
                <li>
                  11.1.4. Вимагати від Адміністрації вебсайту без невиправданої
                  затримки виправити свої неточні персональні дані.
                </li>
                <li>
                  11.1.5. На внесення доповнень до неповних персональних даних,
                  у тому числі шляхом подання додаткової заяви.
                </li>
                <li>
                  11.1.6. Вимагати від Адміністрації вебсайту видалення без
                  невиправданої затримки персональних даних, що належать до
                  нього.
                </li>
                <li>
                  11.1.7. Вимагати від Адміністрації вебсайту обмежити обробку
                  його персональних даних.
                </li>
                <li>
                  11.1.8. Отримати свої персональні дані, які Користувач надав
                  Адміністрації вебсайту.
                </li>
                <li>
                  11.1.9. Заявити заперечення проти обробки своїх персональних
                  даних.
                </li>
                <li>
                  11.1.10. Оскаржити дії або бездіяльність Адміністрації
                  вебсайту:
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  за законодавством України до Уповноваженого Верховної Ради
                  України з прав людини або у судовому порядку;
                </li>
                <li>
                  за законодавством країн-членів Європейського Союзу до
                  уповноваженого органу з захисту прав суб'єктів персональних
                  даних тієї держави, громадянином якої є суб'єкт персональних
                  даних.
                </li>
              </ul>

              <p className={s.text}>
                11.2. Для реалізації своїх прав Користувач направляє вмотивовану
                письмову вимогу на адресу електронної пошти Адміністрації,
                зазначеної на вебсайті з тієї адреси електронної пошти, яку
                Користувач зазначив у формі на оформлення замовлення на
                вебсайті.
              </p>

              <p className={s.text}>
                11.3. Суб'єкт персональних даних зобов'язаний:
              </p>
              <ul className={s.list}>
                <li>11.3.1. Дотримуватись положень Політики.</li>
                <li>
                  11.3.2. У разі зміни змісту персональних даних, щодо яких
                  суб'єкт персональних даних надав згоду на обробку, повідомити
                  Адміністрацію вебсайту в порядку, передбаченому Політикою.
                </li>
              </ul>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              12. ПРАВА ТА ОБОВ'ЯЗКИ АДМІНІСТРАЦІЇ ВЕБСАЙТУ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>12.1. Адміністрація вебсайту має право:</p>
              <ul className={s.list}>
                <li>
                  12.1.1. Вносити зміни до Політики та не повідомляти про це
                  суб'єкта персональних даних окрім випадків, що передбачені
                  Політикою.
                </li>
                <li>
                  12.1.2. Користуватися усіма іншими правами, передбаченими
                  Договором публічної оферти та Політикою.
                </li>
              </ul>

              <p className={s.text}>
                12.2. Адміністрація вебсайту зобов'язана:
              </p>
              <ul className={s.list}>
                <li>
                  12.2.1. Забезпечувати реалізацію прав суб'єкта персональних
                  даних.
                </li>
                <li>
                  12.2.2. Вживати необхідних організаційних і технічних заходів
                  для захисту персональних даних від неправомірного або
                  випадкового доступу, знищення, перекручення, блокування,
                  копіювання, поширення, а також від інших неправомірних дій
                  третіх осіб.
                </li>
                <li>
                  12.2.3. Виконувати усі інші обов'язки Політики, що покладені
                  на Адміністрацію вебсайту.
                </li>
              </ul>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              13. УМОВИ ТА ПРОЦЕДУРА ЗМІНИ, ВИДАЛЕННЯ АБО ЗНИЩЕННЯ ПЕРСОНАЛЬНИХ
              ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                13.1. Внесення змін до персональних даних:
              </p>
              <ul className={s.list}>
                <li>
                  13.1.1. Підставою для внесення змін до персональних даних є
                  вмотивована письмова заява суб'єкта персональних даних,
                  надіслана на адресу електронної пошти Адміністрації сайту з
                  тієї адреси електронної пошти, яку Користувач зазначив у формі
                  або повідомив її Уповноваженим особам під час оформлення
                  замовлення на сайті.
                </li>
                <li>
                  13.1.2. Адміністрація вебсайту перевіряє зміст вимоги суб'єкта
                  персональних даних.
                </li>
                <li>
                  13.1.3. Зміни невідкладно вносяться до бази персональних даних
                  з моменту встановлення невідповідності згідно з заявленими
                  вимогами.
                </li>
              </ul>

              <p className={s.text}>
                13.2. Видалення та знищення персональних даних:
              </p>
              <ul className={s.list}>
                <li>13.2.1. Підставами є:</li>
              </ul>
              <ul className={s.list}>
                <li>
                  Відзив згоди на обробку персональних даних, тобто заперечення
                  проти обробки своїх персональних даних шляхом надсилання
                  вмотивованої письмової вимоги суб'єкта персональних даних у
                  порядку, передбаченому п. 11.2 Політики.
                </li>
                <li>
                  Закінчення строку обробки персональних даних, що передбачений
                  Політикою.
                </li>
              </ul>
              <ul className={s.list}>
                <li>
                  13.2.2. Адміністрація вебсайту повідомляє суб'єкта
                  персональних даних про наслідки відзиву згоди.
                </li>
                <li>
                  13.2.3. Адміністрація вебсайту видаляє або знищує персональні
                  дані без необґрунтованої затримки.
                </li>
                <li>
                  13.2.4. У разі видалення або знищення персональних даних в
                  результаті відзиву згоди на обробку персональних даних,
                  Адміністрація вебсайту має право припинити виконувати
                  зобов'язання, передбачені Договором публічної оферти, та не
                  повертати грошову суму, сплачену суб'єктом персональних даних
                  за послуги.
                </li>
                <li>
                  13.2.5. Про зміну, видалення або знищення персональних даних
                  Адміністрація протягом 10 (десяти) робочих днів повідомляє
                  суб'єкта персональних даних.
                </li>
              </ul>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              14. ПОШИРЕННЯ ТА ТРАНСКОРДОННЕ ПЕРЕМІЩЕННЯ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                14.1. Персональні дані Користувача можуть бути поширені
                (розповсюджені, передані) уповноваженим державним і судовим
                органам тільки при наявності законних підстав і відповідної
                вимоги.
              </p>

              <p className={s.text}>
                14.2. Адміністрація вебсайту має право вносити зміни до Політики
                та передбачати своє право на поширення персональних даних третім
                особам.
              </p>

              <p className={s.text}>
                14.3. Адміністрація повідомляє суб'єктів персональних даних про
                внесення змін щодо поширення їх персональних даних шляхом
                надсилання повідомлення на адресу електронної пошти суб'єкта
                персональних даних. Суб'єкт персональних даних погоджується з
                оновленою редакцією Політики шляхом мовчазної згоди.
              </p>

              <p className={s.text}>
                14.4. У разі, якщо суб'єкт персональних даних не погоджується з
                оновленою редакцією Політики конфіденційності, на останнього
                покладається обов'язок надіслати відзив згоди у порядку,
                передбаченому Політикою.
              </p>

              <p className={s.text}>
                14.5. Транскордонне переміщення за територіальні межі України
                відбувається за наявності таких підстав:
              </p>
              <ul className={s.list}>
                <li>
                  14.5.1. передавання є необхідним на важливих підставах
                  суспільного інтересу;
                </li>
                <li>
                  14.5.2. передавання є необхідним для формування, здійснення
                  або захисту правових претензій;
                </li>
                <li>
                  14.5.3. передавання є необхідним для захисту життєво важливих
                  інтересів суб'єкта даних або інших осіб, якщо суб'єкт даних
                  фізично чи юридично неспроможний надати згоду.
                </li>
              </ul>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>
              15. МЕХАНІЗМИ ЗАХИСТУ ПЕРСОНАЛЬНИХ ДАНИХ
            </h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                15.1. Адміністрація сайту вживає необхідних організаційних і
                технічних заходів для захисту персональної інформації від
                неправомірного або випадкового доступу, знищення, перекручення,
                блокування, копіювання, поширення, а також від інших
                неправомірних дій третіх осіб.
              </p>

              <p className={s.text}>
                15.2. У випадку витоку, незаконного розповсюдження персональних
                даних, що сталися з вини третіх осіб, Адміністрація негайно, з
                моменту виявлення факту витоку та/або незаконного розповсюдження
                персональних даних, повідомляє суб'єктів персональних даних
                шляхом надсилання повідомлення на адресу електронної пошти
                суб'єкта персональних даних.
              </p>

              <p className={s.text}>
                15.3. Сайт та CRM-система, у якій зберігаються персональні дані,
                діють із використанням заходів щодо забезпечення безпеки
                персональних даних.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>16. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                16.1. Адміністрація вебсайту несе відповідальність за збитки,
                понесені Користувачем у зв'язку з неправомірним використанням
                персональних даних, за винятком випадків, передбачених у цьому
                розділі.
              </p>

              <p className={s.text}>
                16.2. У разі втрати або розголошення персональних даних
                Адміністрація вебсайту не несе відповідальність, якщо такі
                персональні дані:
              </p>
              <ul className={s.list}>
                <li>
                  16.2.1. стали або були публічними на момент втрати або
                  розголошення;
                </li>
                <li>
                  16.2.2. були отримані від третьої сторони до моменту її
                  отримання Адміністрацією вебсайту;
                </li>
                <li>16.2.3. були розголошені за згодою Користувача.</li>
              </ul>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>17. ПОРЯДОК ВИРІШЕННЯ СПОРІВ</h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                17.1. Користувач та Адміністрація вебсайту вирішують всі
                суперечки і розбіжності, що виникають з відносин, на які
                поширюється Політика, шляхом переговорів.
              </p>

              <p className={s.text}>
                17.2. Неврегульовані Сторонами спори підлягають вирішенню в
                судовому порядку. Позови пред'являються до суду за
                місцезнаходженням Адміністрації вебсайту.
              </p>
            </div>
          </div>

          <div className={s.section}>
            <h2 className={s.sectionTitle}>18. ПРИКІНЦЕВІ ПОЛОЖЕННЯ</h2>
            <div className={s.sectionContent}>
              <p className={s.text}>
                18.1. Адміністрація вебсайту має право вносити зміни до Політики
                без згоди і повідомлення Користувача, окрім випадків,
                передбачених Політикою.
              </p>

              <p className={s.text}>
                18.2. Оновлена Політика конфіденційності набирає чинності з
                моменту її розміщення на вебсайті, якщо інше не передбачено
                новою редакцією Політики.
              </p>

              <p className={s.text}>
                18.3. Інформована згода на розсилку, Повідомлення про обробку
                Cookies-файлів та інші положення у будь-якій формі щодо обробки
                персональних даних, які розміщені на вебсайті є невід'ємними
                частинами цієї Політики конфіденційності.
              </p>

              <p className={s.text}>
                18.4. Текст Політики конфіденційності викладено українською
                мовою.
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}
